opengl_basic.org
#+TITLE:     OpenGL入门知识
#+AUTHOR:    Joseph Pan
#+EMAIL:     cs.wzpan@gmail.com
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   ./opengl_index.html

* 函数名约定

  绝大多数OpenGL函数都遵循一种命名约定，说明了这个函数来自哪个函数库，并且常常提示了这个函数将接受的参数的数量和类型。所有函数名都具有一个根名称，表示这个函数对应的OpenGL点类型的参数。所有的OpenGL函数都采用了下面的格式。

#+BEGIN_EXAMPLE
<函数库前缀><根命令><可选的参数数量><可选的参数类型>
#+END_EXAMPLE

例如：

#+BEGIN_EXAMPLE
glColor3f(...)
#+END_EXAMPLE

所有遵循标准的C/C++编译器都假定所有浮点型字面值的类型为double，除非显式地用后缀进行了指定。使用字面值作为浮点型参数时，如果不把这些参数值指定为float类型（而不是double类型），那么编译器在编译时会发出警告信息，因为它检测到了向一个定义为只接受float参数的函数传递了double类型的参数，结果可能导致精度的损失。随着OpenGL程序规模的增长，这类警告信息很可能会迅速增加，达到数百个之多，结果难以找到真正的语法错误。虽然可以通过适当的编译器选项关闭这些警告信息，但我们建议不要这么做。更好的办法是一开始就编写清晰、可移植的代码。

* 数据类型

#+INDEX: GLbyte
#+INDEX: GLshort
#+INDEX: GLint
#+INDEX: GLsizei
#+INDEX: GLdouble
#+INDEX: GLfloat
#+INDEX: GLclampf  
#+INDEX: GLclampd
#+INDEX: GLushort                    
#+INDEX: GLunit
#+INDEX: GLenum
#+INDEX: GLbitfield
#+INDEX: GLchar
#+INDEX: GLsizeiptr
#+INDEX: GLintptr

为了保证移植性，OpenGL定义了自己的数据类型。表2.1列出了OpenGL数据类型、它们在32位
环境（Win32/OS X等）中对应的C/C++数据类型以及正确的字面值后缀。

| OpenGL数据类型             | 内部表示形式   | 对应的C数据类型 | C字面值后缀 |
|----------------------------+----------------+-----------------+-------------|
| GLbyte                     | 8位整数        | signed char     | b           |
| GLshort                    | 16位整数       | short           | s           |
| GLint, GLsizei             | 32位整数       | long            | l           |
| GLfloat, GLclampf          | 32位浮点数     | float           | f           |
| GLdouble, GLclampd         | 64位浮点数     | double          | d           |
| GLubyte, GLboolean         | 8位无符号整数  | unsigned char   | ub          |
| GLushort                   | 16位无符号整数 | unsigned short  | us          |
| GLunit, GLenum, GLbitfield | 32位无符号整数 | unsigned long   | ui          |
| GLchar                     | 8位的字符      | char            | 无          |
| GLsizeiptr, GLintptr       | 本地指针       | ptrdiff_t       | 无           |

    所有的数据类型都以GL开头，表示OpenGL。随后是它们对应的C数据类型（如byte、short、int、float等），有些前面还有个u，表示这是一种无符号数据类型。在有些用法中，OpenGL使用了更具描述性的名字，比如在类型中增加一个size表示这种类型的长度或深度。例如，GLsizei是一个OpenGL变量，它用一个整数来表示一个size参数；clamp则是一种提示，表示这个值的范围将“截取”在0.0～1.0的范围内；GLboolean变量表示真假条件；GLenum表示枚举变量；GLbitfield表示那些包含二进制位段的变量。

    OpenGL并没有对指针和数组做特殊的考虑。我们可以像下面这样声明一个包含10个GLshort变量的数组：

#+BEGIN_SRC c
GLshort shorts[10];
#+END_SRC

    下面这行代码则声明了一个长度为10的GLdouble类型的指针数组：

#+BEGIN_SRC c
GLdouble *doubles[10];
#+END_SRC

    

    
* 错误

    OpenGL提供了一种有用的机制，可在代码中执行一种场合性的完整性检查。

** 当良好代码中混入了不好的东西时

   OpenGL在内部维护了一组标志（共6个）。每个标志代表一种不同类型的错误。当一个错误发生时，与这个错误相对应的标志就会被设置。为了观察哪些标志被设置，可以调用 =glGetError= 函数。

#+INDEX: glGetError   
#+INDEX: GL_INVALID_ENUM      
#+INDEX: GL_INVALID_VALUE       
#+INDEX: GL_INVALID_OPERATION 
#+INDEX: GL_STACK_OVERFLOW    
#+INDEX: GL_STACK_UNDERFLOW   
#+INDEX: GL_OUT_OF_MEMORY     
#+INDEX: GL_TABLE_TOO_LARGE   
#+INDEX: GL_NO_ERROR
#+INDEX: gluErrorString             

   #+BEGIN_SRC c
   GLenum glGetError(void);
   #+END_SRC

   =glGetError= 函数返回下表所列的其中一个值。GLU函数库自己定义了3个错误，但这些错误正好与其中已经存在的2个标志匹配。如果被设置的标志不止一个， =glGetError= 仍然只返回一个唯一的值。当 =glGetError= 函数被调用时，这个值随后被清除，然后 =glGetError= 将再次返回一个错误标志或 =GL_NO_ERROR= 。通常，需要在一个循环中调用 =glGetError= 函数，持续检查错误标志，直到返回值是 =GL_NO_ERROR= 。

   #+CAPTION: OpenGL错误代码

   | 错误代码             | 描述                         |
   |----------------------+------------------------------|
   | GL_INVALID_ENUM      | 枚举参数超出范围             |
   | GL_INVALID_VALUE     | 数值参数超出范围             |
   | GL_INVALID_OPERATION | 在当前的状态中操作非法       |
   | GL_STACK_OVERFLOW    | 这条命令将导致堆栈上溢       |
   | GL_STACK_UNDERFLOW   | 这条命令将导致堆栈下溢       |
   | GL_OUT_OF_MEMORY     | 没有足够的内存来执行这条命令 |
   | GL_TABLE_TOO_LARGE   | 指定的表太大                 |
   | GL_NO_ERROR          | 没有错误出现                 |
   
   我们可以使用GLU函数库的另一个函数 =gluErrorString= 来获得一个描述错误标志的字符串。

   #+BEGIN_SRC c
   const GLubyte* gluErrorString(GLenum errorcode);
   #+END_SRC

   这个函数将错误标志（由 =glGetError= 函数返回）作为它的唯一参数，并返回一个描述这个错误的静态字符串。例如，错误标志 =GL_INVALID_ENUM= 将返回下面这个字符串。

   #+BEGIN_SRC c
   invalid enumerant（无效的枚举）
   #+END_SRC

   如果一个错误是由于对OpenGL的非法调用所致，那么这条命令或函数调用将会被忽略。对此，我们可能会稍微感到安心。此时，唯一可能造成麻烦的是那些接受指向内存的指针作为参数的函数（如果指针无效，可能导致程序崩溃）。   

* 确认版本

  有时候我们希望利用一个特定环境所提供的一些特定功能。如果知道自己的程序将运行于一个特定生产商所生产的图形卡之上，就可能想依赖这个生产商特有的一些性能特征来改进程序。我们还可能希望限制这个特定厂商所提供的驱动程序的最低版本号。为此，需要查询OpenGL的渲染引擎（OpenGL驱动程序）的生产商和版本号。GL函数库和GLU函数库都可以返回与它们的版本号和生产商有关的特定信息。

** 获得GL函数库的信息

#+INDEX: glGetString

为了确定GL函数库的信息，可以调用 =glGetString= 。

#+BEGIN_SRC c
const GLubyte *glGetString(GLenum name);
#+END_SRC

这个函数返回一个静态的字符串，描述了GL函数库的相关信息。

** 获得GLU函数库的信息

#+INDEX: gluGetString  
  
GLU函数库提供了另一个对应的函数 =gluGetString= 。

#+BEGIN_SRC c
const GLubyte *gluGetString(GLenum name);
#+END_SRC

这个函数返回一个字符串，描述它所请求的GLU函数的相关信息。

* 使用 glHint 获取线索
#+INDEX: glHint

  glHint函数允许我们指定偏重于视觉质量还是速度，以适应各种不同类型的操作需求。这个函数定义如下所示。

  #+BEGIN_SRC c
    void glHint(GLenum target, GLenum mode);  
  #+END_SRC

  我们可以在target参数中指定希望进行修改的行为类型。mode参数告诉OpenGL我们最为关心的是什么，例如更快的渲染质量还是最好的输出质量。
  
