opengl_basic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ch" xml:lang="ch">
<head>
<title>OpenGL入门知识</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="OpenGL入门知识"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 14:49:20 CST"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./opengl_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">OpenGL入门知识</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 函数名约定</a></li>
<li><a href="#sec-2">2 数据类型</a></li>
<li><a href="#sec-3">3 错误</a>
<ul>
<li><a href="#sec-3-1">3.1 当良好代码中混入了不好的东西时</a></li>
</ul>
</li>
<li><a href="#sec-4">4 确认版本</a>
<ul>
<li><a href="#sec-4-1">4.1 获得GL函数库的信息</a></li>
<li><a href="#sec-4-2">4.2 获得GLU函数库的信息</a></li>
</ul>
</li>
<li><a href="#sec-5">5 使用 glHint 获取线索</a></li>
<li><a href="#sec-6">6 状态机</a>
<ul>
<li><a href="#sec-6-1">6.1 保存和恢复状态</a></li>
</ul>
</li>
<li><a href="#sec-7">7 颜色</a>
<ul>
<li><a href="#sec-7-1">7.1 OpenGL中的颜色</a></li>
<li><a href="#sec-7-2">7.2 一些常见的组合颜色</a></li>
<li><a href="#sec-7-3">7.3 alpha成分</a></li>
</ul>
</li>
<li><a href="#sec-8">8 使用扩展</a>
<ul>
<li><a href="#sec-8-1">8.1 检查扩展</a></li>
<li><a href="#sec-8-2">8.2 这是谁的扩展</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 函数名约定</h2>
<div class="outline-text-2" id="text-1">


<p>
  绝大多数OpenGL函数都遵循一种命名约定，说明了这个函数来自哪个函数库，并且常常提示了这个函数将接受的参数的数量和类型。所有函数名都具有一个根名称，表示这个函数对应的OpenGL点类型的参数。所有的OpenGL函数都采用了下面的格式。
</p>



<pre class="example">&lt;函数库前缀&gt;&lt;根命令&gt;&lt;可选的参数数量&gt;&lt;可选的参数类型&gt;
</pre>


<p>
例如：
</p>



<pre class="example">glColor3f(...)
</pre>


<p>
所有遵循标准的C/C++编译器都假定所有浮点型字面值的类型为double，除非显式地用后缀进行了指定。使用字面值作为浮点型参数时，如果不把这些参数值指定为float类型（而不是double类型），那么编译器在编译时会发出警告信息，因为它检测到了向一个定义为只接受float参数的函数传递了double类型的参数，结果可能导致精度的损失。随着OpenGL程序规模的增长，这类警告信息很可能会迅速增加，达到数百个之多，结果难以找到真正的语法错误。虽然可以通过适当的编译器选项关闭这些警告信息，但我们建议不要这么做。更好的办法是一开始就编写清晰、可移植的代码。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数据类型</h2>
<div class="outline-text-2" id="text-2">



<p>
为了保证移植性，OpenGL定义了自己的数据类型。表2.1列出了OpenGL数据类型、它们在32位
环境（Win32/OS X等）中对应的C/C++数据类型以及正确的字面值后缀。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">OpenGL数据类型</th><th scope="col" class="left">内部表示形式</th><th scope="col" class="left">对应的C数据类型</th><th scope="col" class="left">C字面值后缀</th></tr>
</thead>
<tbody>
<tr><td class="left">GLbyte</td><td class="left">8位整数</td><td class="left">signed char</td><td class="left">b</td></tr>
<tr><td class="left">GLshort</td><td class="left">16位整数</td><td class="left">short</td><td class="left">s</td></tr>
<tr><td class="left">GLint, GLsizei</td><td class="left">32位整数</td><td class="left">long</td><td class="left">l</td></tr>
<tr><td class="left">GLfloat, GLclampf</td><td class="left">32位浮点数</td><td class="left">float</td><td class="left">f</td></tr>
<tr><td class="left">GLdouble, GLclampd</td><td class="left">64位浮点数</td><td class="left">double</td><td class="left">d</td></tr>
<tr><td class="left">GLubyte, GLboolean</td><td class="left">8位无符号整数</td><td class="left">unsigned char</td><td class="left">ub</td></tr>
<tr><td class="left">GLushort</td><td class="left">16位无符号整数</td><td class="left">unsigned short</td><td class="left">us</td></tr>
<tr><td class="left">GLunit, GLenum, GLbitfield</td><td class="left">32位无符号整数</td><td class="left">unsigned long</td><td class="left">ui</td></tr>
<tr><td class="left">GLchar</td><td class="left">8位的字符</td><td class="left">char</td><td class="left">无</td></tr>
<tr><td class="left">GLsizeiptr, GLintptr</td><td class="left">本地指针</td><td class="left">ptrdiff_t</td><td class="left">无</td></tr>
</tbody>
</table>


<p>
    所有的数据类型都以GL开头，表示OpenGL。随后是它们对应的C数据类型（如byte、short、int、float等），有些前面还有个u，表示这是一种无符号数据类型。在有些用法中，OpenGL使用了更具描述性的名字，比如在类型中增加一个size表示这种类型的长度或深度。例如，GLsizei是一个OpenGL变量，它用一个整数来表示一个size参数；clamp则是一种提示，表示这个值的范围将“截取”在0.0～1.0的范围内；GLboolean变量表示真假条件；GLenum表示枚举变量；GLbitfield表示那些包含二进制位段的变量。
</p>
<p>
    OpenGL并没有对指针和数组做特殊的考虑。我们可以像下面这样声明一个包含10个GLshort变量的数组：
</p>



<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">GLshort</span> <span style="color: #ffd700; font-style: italic;">shorts</span>[10];
</pre>


<p>
    下面这行代码则声明了一个长度为10的GLdouble类型的指针数组：
</p>



<pre class="src src-c">GLdouble *doubles[10];
</pre>





</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 错误</h2>
<div class="outline-text-2" id="text-3">


<p>
    OpenGL提供了一种有用的机制，可在代码中执行一种场合性的完整性检查。
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 当良好代码中混入了不好的东西时</h3>
<div class="outline-text-3" id="text-3-1">


<p>
   OpenGL在内部维护了一组标志（共6个）。每个标志代表一种不同类型的错误。当一个错误发生时，与这个错误相对应的标志就会被设置。为了观察哪些标志被设置，可以调用 <code>glGetError</code> 函数。
</p>




<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">GLenum</span> <span style="color: #ffd700; font-weight: bold;">glGetError</span>(<span style="color: #00ffff; font-weight: bold;">void</span>);
</pre>


<p>
   <code>glGetError</code> 函数返回下表所列的其中一个值。GLU函数库自己定义了3个错误，但这些错误正好与其中已经存在的2个标志匹配。如果被设置的标志不止一个， <code>glGetError</code> 仍然只返回一个唯一的值。当 <code>glGetError</code> 函数被调用时，这个值随后被清除，然后 <code>glGetError</code> 将再次返回一个错误标志或 <code>GL_NO_ERROR</code> 。通常，需要在一个循环中调用 <code>glGetError</code> 函数，持续检查错误标志，直到返回值是 <code>GL_NO_ERROR</code> 。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>OpenGL错误代码</caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">错误代码</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="left">GL_INVALID_ENUM</td><td class="left">枚举参数超出范围</td></tr>
<tr><td class="left">GL_INVALID_VALUE</td><td class="left">数值参数超出范围</td></tr>
<tr><td class="left">GL_INVALID_OPERATION</td><td class="left">在当前的状态中操作非法</td></tr>
<tr><td class="left">GL_STACK_OVERFLOW</td><td class="left">这条命令将导致堆栈上溢</td></tr>
<tr><td class="left">GL_STACK_UNDERFLOW</td><td class="left">这条命令将导致堆栈下溢</td></tr>
<tr><td class="left">GL_OUT_OF_MEMORY</td><td class="left">没有足够的内存来执行这条命令</td></tr>
<tr><td class="left">GL_TABLE_TOO_LARGE</td><td class="left">指定的表太大</td></tr>
<tr><td class="left">GL_NO_ERROR</td><td class="left">没有错误出现</td></tr>
</tbody>
</table>


<p>   
   我们可以使用GLU函数库的另一个函数 <code>gluErrorString</code> 来获得一个描述错误标志的字符串。
</p>



<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ffff; font-weight: bold;">GLubyte</span>* <span style="color: #ffd700; font-weight: bold;">gluErrorString</span>(<span style="color: #00ffff; font-weight: bold;">GLenum</span> <span style="color: #ffd700; font-style: italic;">errorcode</span>);
</pre>


<p>
   这个函数将错误标志（由 <code>glGetError</code> 函数返回）作为它的唯一参数，并返回一个描述这个错误的静态字符串。例如，错误标志 <code>GL_INVALID_ENUM</code> 将返回下面这个字符串。
</p>



<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">invalid</span> <span style="color: #ffd700; font-style: italic;">enumerant</span>&#65288;&#26080;&#25928;&#30340;&#26522;&#20030;&#65289;
</pre>


<p>
   如果一个错误是由于对OpenGL的非法调用所致，那么这条命令或函数调用将会被忽略。对此，我们可能会稍微感到安心。此时，唯一可能造成麻烦的是那些接受指向内存的指针作为参数的函数（如果指针无效，可能导致程序崩溃）。   
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 确认版本</h2>
<div class="outline-text-2" id="text-4">


<p>
  有时候我们希望利用一个特定环境所提供的一些特定功能。如果知道自己的程序将运行于一个特定生产商所生产的图形卡之上，就可能想依赖这个生产商特有的一些性能特征来改进程序。我们还可能希望限制这个特定厂商所提供的驱动程序的最低版本号。为此，需要查询OpenGL的渲染引擎（OpenGL驱动程序）的生产商和版本号。GL函数库和GLU函数库都可以返回与它们的版本号和生产商有关的特定信息。
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 获得GL函数库的信息</h3>
<div class="outline-text-3" id="text-4-1">



<p>
为了确定GL函数库的信息，可以调用 <code>glGetString</code> 。
</p>



<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ffff; font-weight: bold;">GLubyte</span> *<span style="color: #ffd700; font-weight: bold;">glGetString</span>(<span style="color: #00ffff; font-weight: bold;">GLenum</span> <span style="color: #ffd700; font-style: italic;">name</span>);
</pre>


<p>
这个函数返回一个静态的字符串，描述了GL函数库的相关信息。
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 获得GLU函数库的信息</h3>
<div class="outline-text-3" id="text-4-2">



<p>  
GLU函数库提供了另一个对应的函数 <code>gluGetString</code> 。
</p>



<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ffff; font-weight: bold;">GLubyte</span> *<span style="color: #ffd700; font-weight: bold;">gluGetString</span>(<span style="color: #00ffff; font-weight: bold;">GLenum</span> <span style="color: #ffd700; font-style: italic;">name</span>);
</pre>


<p>
这个函数返回一个字符串，描述它所请求的GLU函数的相关信息。
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 使用 glHint 获取线索</h2>
<div class="outline-text-2" id="text-5">


<p>
  glHint函数允许我们指定偏重于视觉质量还是速度，以适应各种不同类型的操作需求。这个函数定义如下所示。
</p>



<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">void</span> <span style="color: #ffd700; font-weight: bold;">glHint</span>(<span style="color: #00ffff; font-weight: bold;">GLenum</span> <span style="color: #ffd700; font-style: italic;">target</span>, <span style="color: #00ffff; font-weight: bold;">GLenum</span> <span style="color: #ffd700; font-style: italic;">mode</span>);  
</pre>


<p>
  我们可以在target参数中指定希望进行修改的行为类型。mode参数告诉OpenGL我们最为关心的是什么，例如更快的渲染质量还是最好的输出质量。
</p>
</div>

</div>
