opengl_basic.org
* 状态机

  状态机是一个抽象的模型，表示一组状态变量的集合。每个状态变量可以有各种不同的值，例如可以打开或关闭等。当我们在OpenGL中进行绘图时，如果每次都要指定所有这些变量显然有点不切实际。反之，OpenGL使用了一种状态模型（或称状态机）来追踪所有的OpenGL状态变量。当一个状态值被设置之后，它就一直保持这个状态，直到其他函数对它进行了修改。许多状态只是简单的打开或关闭。

  例如，光照要么打开，要么关闭。如果几何图形不使用光照，那么在绘制这个几何图形的颜色集合时就不必进行任何光照计算。如果启用了光照效率，那么此后所绘制的几何图形都将进行光照计算。

  为了打开这些类型的状态变量，可以使用下面这个OpenGL函数。

#+INDEX: glEnable  

  #+BEGIN_SRC c
  void glEnable(GLenum capability);
  #+END_SRC

  我们可以使用下面这个对应的函数，将这些变量的状态设置为关闭。

#+INDEX: glDisable

  #+BEGIN_SRC c
  void glDisable(GLenum capability);
  #+END_SRC

  以光照为例，可以使用下面这个函数调用打开光照效果。

  #+BEGIN_SRC c
  glEnable(GL_LIGHTING);
  #+END_SRC

  也可以使用下面这个函数调用关闭光照效果。

  #+BEGIN_SRC c
  glDisable(GL_LIGHTING);
  #+END_SRC

  如果希望对一个状态变量进行测试，判断它是否被打开，OpenGL还提供了一种方便的机制。

#+INDEX: glIsEnabled

  #+BEGIN_SRC c
  GLboolean glIsEnabled(GLenum capability);
  #+END_SRC

  但是，并不是所有的状态变量都是简单的打开或关闭。许多OpenGL函数专门用于设置变量的值，此后这些变量将一直保持被设置时的值，直到再次被修改。在任何时候，都可以查询这些变量的值，OpenGL提供了一组查询函数，可以查询布尔型、整型、单精度浮点型和双精度浮点型变量的值。这4个函数的原型如下所示。

#+INDEX: glGetBooleanv
#+INDEX: glGetDoublev
#+INDEX: glGetFloatv
#+INDEX: glGetIntegerv

  #+BEGIN_SRC c
  void glGetBooleanv(GLenum pname, GLboolean *params);
  void glGetDoublev(GLenum pname, GLdouble *params); 
  void glGetFloatv(GLenum pname, GLfloat *params);  
  void glGetIntegerv(GLenum pname, GLint *params);
  #+END_SRC

  每个函数返回单个值，或者返回一个数组，把一些值存储到参数所指定的地址中。

** 保存和恢复状态

  OpenGL还提供堆栈来保存一组范围内的所有状态值，并在将来恢复它们。

  可以使用下面这个命令，把一个OpenGL状态值或一组范围的相关状态值压入到属性堆栈中。

#+INDEX: glPushAttrib  

  #+BEGIN_SRC c
  void glPushAttrib(GLbitfield mask);
  #+END_SRC

  以后，可以使用下面这个命令提取对应的值。

#+INDEX: glPopAttrib

  #+BEGIN_SRC c
  void glPopAttrib(GLbitfield mask);
  #+END_SRC

  注意，这两个函数的参数是个位段，也就是一个 *位掩码* ，这意味着可以在单个函数调用中用位OR（在C中使用"|"操作符）操作来表示多个状态。例如，可以用下面这个调用保存光照和纹理状态。

  #+BEGIN_SRC c
  glPushAttrib(GL_TEXTURE_BIT | GL_LIGHTING_BIT);
  #+END_SRC

  
  
  
* 颜色
** OpenGL中的颜色

   在绝大多数OpenGL实现中，GLclampf被定义为float类型。在OpenGL中，一种颜色是由红、绿、蓝成分混合而成。每种成分的值范围可以是从0.0至1.0之间的任何有效的浮点值，因此理论上可以产生的颜色数量是无限的。但从现实的角度讲，在绝大多数设备中，颜色值的输出限制在24位（1600万种颜色）。
   
   很自然的，OpenGL接受这个颜色值，并在内部把它转换为能够与可用的视频硬件准确匹配的最接近颜色。

** 一些常见的组合颜色   

   #+CAPTION: 一些常见的组合颜色

   | 组合颜色                | 红色成分 | 绿色成分 | 蓝色成分 |
   |-------------------------+----------+----------+----------|
   | Black（黑）             |      0.0 |      0.0 |      0.0 |
   | Red（红）               |      1.0 |      0.0 |      0.0 |
   | Green（绿）             |      0.0 |      1.0 |      0.0 |
   | Yellow（黄）            |      1.0 |      1.0 |      0.0 |
   | Blue（蓝）              |      0.0 |      0.0 |      1.0 |
   | Magenta（洋红）         |      1.0 |      0.0 |      1.0 |
   | Cyan（青）              |      0.0 |      1.0 |      1.0 |
   | Dark gray（深灰）       |     0.25 |     0.25 |     0.25 |
   | Light gray（浅灰）      |     0.75 |     0.75 |     0.75 |
   | Brown（褐）             |     0.60 |     0.40 |     0.12 |
   | Pumpkin orange(南瓜橙)  |     0.98 |    0.625 |     0.12 |
   | Pastel pink（粉红）     |     0.98 |     0.04 |      0.7 |
   | Barney purple（巴尼紫） |     0.60 |     0.40 |     0.70 |
   | White（白）             |      1.0 |      1.0 |      1.0 |

** alpha成分

   alpha成分用于混合，并可以产生一种特殊的效果，例如透明度。透明是指一个物体允许光线穿透它。假定我们希望创建一块染成红色的玻璃，并且它的后面正好有一束蓝色的光。这道蓝光就会影响这块玻璃上的红色（蓝+红=紫）。我们可以用alpha成分值生成一种半透明的红色，使它看上去像是一块玻璃——它后面的物体也能够显示。这种类型的效果涉及很多复杂的地方，并不仅仅使alpha值就行了。

   
   
   
   
   
* 使用扩展
OpenGL允许硬件生产商通过扩展机制提供创新。这种机制以两种方式发挥作用。首先，生产商可以向OpenGL API添加新的函数，供开发人员使用。其次，只要能够为原有OpenGL函数（如glEnable）所认识，生产商就可以添加新的标记或枚举定义。

使用新的枚举或标记是件非常简单的事，只要在项目中增加生产商所提供的头文件就可以了。生产商必须向OpenGL Working Group（Khronos Group的一个子集）注册它们的扩展，这样就可以防止一个生产商使用其他生产商已经使用的值。为了方便起见，标准头文件glext.h包含了一些最常见的扩展。

** 检查扩展

   我们可以检查一个字符串，确认OpenGL驱动程序的生产商和版本号。我们还可以获取一个包含了由驱动程序所支持的所有OpenGL扩展的标志符的字符串。下面这行代码返回一个字符数组，表示了扩展的名称。

   #+BEGIN_SRC c
   const char *szExtensions = glGetString(GL_EXTENSIONS);
   #+END_SRC

   这个字符串包含了由驱动程序所支持的所有扩展的名称（用空格分隔）。然后，我们就可以在这个字符串中查找，查找希望使用的扩展标志符。例如，我们可以像下面这样快速查找一种Windows特定的扩展。

   #+BEGIN_SRC c
   if(strstr(extensions, "WGL_EXT_swap_control" != NULL))
	 {
	 wglSwapIntervalEXT =
		 (PFNWGLSWAPINTERVALEXTPROC)wglGetProcAddress("wglSwapIntervalEXT");

	 if(wqlSwapIntervalEXT != NULL)
		 wglSwapIntervalEXT(1);
	 }
   #+END_SRC

   如果使用这种方法，还应该确保扩展名后面的那个字符是空格或NULL。否则，如果这个扩展被WGL_EXT_swap_control2所取代，那会发生什么情况呢？此时，C运行时函数strstr仍然找到第一个字符串，但是我们无法确定第二个扩展的行为是不是完全和第一个相同。

