opengl_basic.org
** 这是谁的扩展

   使用OpenGL扩展，我们可以在代码中提供代码路径，以改进a渲染性能和视觉质量，甚至添加只由一个特定生产商的硬件所支持的特殊效果。但是，是谁拥有这个扩展呢？也就是说，是哪个生产商创建并支持一个特定的扩展呢？通常我们只需观察扩展名就可以作出判断。每个扩展标识符的前面都有一个3字母的前缀，标明了扩展的来源。

   下表提供了扩展标识符的一些例子。

   #+CAPTION: OpenGL扩展前缀的一些例子

   | 前缀 | 厂商             |
   |------+------------------|
   | SGI_ | Silicon Graphics |
   | ATI_ | ATI Technologies |
   | NV_  | NVIDIA           |
   | IBM_ | IBM              |
   | WGL_ | Microsoft        |
   | EXT_ | 跨厂商           |
   | ARB_ | ARB 批准         |

   一个生产商支持另一生产商的扩展的情况并非罕见。例如，有些NVidia扩展得到了广泛应用，并受到ATI硬件的支持。此时，进行竞争的生产商必须遵循原生产商的规范（扩展如何实现的细节）。有时候，所有生产商都认为某个扩展非常好并予以支持，此时这个扩展就将具有EXT_前缀，表示它不偏向于任何生产商并且受到了跨平台的广泛支持。

   最后，还有一种ARB扩展的扩展。这种类型的扩展已经通过了OpenGL ARB的审查（并进行了辩论）。这些扩展所提供的新技巧或新函数很快就将融入到核心OpenGL规范。





  

  
