opengl_basic.html

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 这是谁的扩展</h3>
<div class="outline-text-3" id="text-8-2">


<p>
   使用OpenGL扩展，我们可以在代码中提供代码路径，以改进a渲染性能和视觉质量，甚至添加只由一个特定生产商的硬件所支持的特殊效果。但是，是谁拥有这个扩展呢？也就是说，是哪个生产商创建并支持一个特定的扩展呢？通常我们只需观察扩展名就可以作出判断。每个扩展标识符的前面都有一个3字母的前缀，标明了扩展的来源。
</p>
<p>
   下表提供了扩展标识符的一些例子。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>OpenGL扩展前缀的一些例子</caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">前缀</th><th scope="col" class="left">厂商</th></tr>
</thead>
<tbody>
<tr><td class="left">SGI_</td><td class="left">Silicon Graphics</td></tr>
<tr><td class="left">ATI_</td><td class="left">ATI Technologies</td></tr>
<tr><td class="left">NV_</td><td class="left">NVIDIA</td></tr>
<tr><td class="left">IBM_</td><td class="left">IBM</td></tr>
<tr><td class="left">WGL_</td><td class="left">Microsoft</td></tr>
<tr><td class="left">EXT_</td><td class="left">跨厂商</td></tr>
<tr><td class="left">ARB_</td><td class="left">ARB 批准</td></tr>
</tbody>
</table>


<p>
   一个生产商支持另一生产商的扩展的情况并非罕见。例如，有些NVidia扩展得到了广泛应用，并受到ATI硬件的支持。此时，进行竞争的生产商必须遵循原生产商的规范（扩展如何实现的细节）。有时候，所有生产商都认为某个扩展非常好并予以支持，此时这个扩展就将具有EXT_前缀，表示它不偏向于任何生产商并且受到了跨平台的广泛支持。
</p>
<p>
   最后，还有一种ARB扩展的扩展。这种类型的扩展已经通过了OpenGL ARB的审查（并进行了辩论）。这些扩展所提供的新技巧或新函数很快就将融入到核心OpenGL规范。
</p>







</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 14:49:20 CST</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
